app/views/users/show.html.erb

              Followers <span class='badge badge-important'>5</span>
              <p>Posts <span class='badge badge'><%= @user.posts.count %></span></p>
---
SELECT "posts".* FROM "posts" WHERE "posts"."user_id" = ? ORDER BY "posts"."created_at" DESC  [["user_id", 2]]
SELECT COUNT(*) FROM "posts" WHERE "posts"."user_id" = ?  [["user_id", 2]]