app/views/posts/index.html.erb

            <div class='media-left'>
              <%= image_tag @user.find(post.user_id).avatar.thumb.url, size: '50', class: 'img-circle', alt: 'Avatar' if @user.find(post.user_id).avatar? %>
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]