app/views/posts/show.html.erb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]
---
						<div class='media-left'>
							<% if User.find(@post.user_id).avatar? %>

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", 1]]
---
								<ul class="media-list">
									<% @post.comments.each do |c| %>