app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "comments" ("body", "post_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["body", "BOooooooooooooooooooooOOOO!!!!\r\n"], ["post_id", 1], ["created_at", "2017-09-26 16:54:21.927017"], ["updated_at", "2017-09-26 16:54:21.927017"]]
UPDATE "comments" SET "user_id" = ?, "updated_at" = ? WHERE "comments"."id" = ?  [["user_id", 1], ["updated_at", "2017-09-26 16:54:22.062985"], ["id", 1]]
UPDATE "users" SET "last_activity_at" = '2017-12-07 14:23:32.560769' WHERE "users"."id" = ?  [["id", 4]]
---
  def create
    #@post = @user.posts.find(params[:post_id])
    @post = Post.find(params[:post_id])

    if @comment = @post.comments.create(comment_params)
      @comment.user_id = current_user.id
      @comment.save