app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts" ORDER BY "posts"."created_at" DESC
SELECT "users".* FROM "users"
---
  def index
    @post = Post.all
    @user = User.all

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "posts" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Hello world!"], ["body", ":D"], ["user_id", 1], ["created_at", "2017-09-26 16:54:12.916831"], ["updated_at", "2017-09-26 16:54:12.916831"]]
---
  def create
    @user = User.find(current_user.id)

    if @user.posts.create(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def edit
    @post = Post.find(params[:id])

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT  "posts".* FROM "posts" WHERE "posts"."user_id" = ? AND "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "posts" SET "title" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "Franco"], ["updated_at", "2017-12-07 14:22:58.841600"], ["id", 2]]
UPDATE "users" SET "last_activity_at" = '2017-12-07 14:22:58.987990' WHERE "users"."id" = ?  [["id", 2]]
---
  def update
    @user = User.find(current_user.id)
    @post = @user.posts.find(params[:id])

    if @post.update_attributes(post_params)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? ORDER BY "posts"."created_at" DESC LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def show
    #@user = User.find(current_user.id)
    @post = Post.find(params[:id])